# Վարժություն 1.5
# Ստեղծել ֆունկցիա, որը ստանում է երկու թվային արգումենտ` a և b,
# և վերադարձնում է a-ից մինչև b ընկած ամբողջ թվերի գումարը։ Կարող եք ենթադրել,
# որ առաջին արգումենտը միշտ փոքր է երկրորդից։

# Վարժություն 1.6
# Իրականացնել նախորդ վարժությունում տրված ֆունկցիան՝ հաշվի առնելով,
# որ առաջին արգումենտը կարող է մեծ լինել երկրորդից։ Այդ դեպքում ֆունկցիան
# պետք է վերադարձնի b-ից մինչև a ամբողջ թվերի գումարը։

def sumAll(first, second):
    if first > second:
        return((first-second)+1) * (first + second) / 2
    else:
        return ((second-first)+1) * (first + second) / 2


print(sumAll(2, 5))  # output is equal to 14

# Վարժություն 1.7
# Իրականացնել pow(a, b) ֆունկցիան՝ հաշվի առնելով, որ b-ն կարող է լինել
# նաև ոչ դրական։


def pow(x, y):
    temp = 0
    if(y == 0):
        return 1
    temp = pow(x, int(y / 2))
    if (y % 2 == 0):
        return temp * temp
    else:
        return x * temp * temp


print(pow(2, 3))
